/***********************************/
// البسيط
/***********************************/

var baseet =
    bp +
    '.البحر البسيط، والبسيط من البَسْط والامتداد، فهو بمعنى المبسوط الممدود، وسُمِّيَ بذلك لأنه باعتبار أصل بنائه تصل حروف البيت الواحد منه إلى ثمانية وأربعين حرفًا -كالطويل والمديد-، ومما بُنِيَ على هذا البحر: مُعَلّقَة النابغة، و”رثاء الأندلس” للرندي، وكثير من المدائح النبوية مثل: قصيدة “بانَتْ سُعاد” لكعب بن زهير.' +
    '<br />◆ أصل بنائه: مُسْتَفْعِلُنْ فاعلن مستفعلن فاعلن * مستفعلن فاعلن مستفعلن فاعلن' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تام (مخبون العروض والضرب).' +
    '<br />2️⃣ تام (عروضه مخبونة، وضربه مقطوع).' +
    '<br />3️⃣ مجزوء (عروضه صحيحة، وضربه مُذَيَّل).' +
    '<br />4️⃣ مجزوء (عروضه صحيحة، وضربه صحيح).' +
    '<br />5️⃣ مجزوء (عروضه صحيحة، وضربه مقطوع).' +
    '<br />6️⃣ مجزوء (مقطوع العروض والضرب).' +
    '<br />7️⃣ مجزوء (عروضه وضربه مخبونان مقطوعان) ويُسَمَّى “المُخَلَّع”.' +
    '<br />🔴 ومجزوء البسيط كله نادر باستثناء “المُخَلَّع”، وعليه: فلا نرى جَدْوَى من الإطالة في دراسة تلك الصور النادرة، فنكتفي بدراسة التام بصورتيْهِ ثم المجزوء المُخَلَّع فحسْب.' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_18">للاستزادة</a>' +
    cp;

// تام 1
awzaan['baseet1'] = {
    'name': 'البحر البسيط',
    'type': 'تام',
    'desc': '[العروض: مخبونة] - [الضرب: مخبون]',
    'orig': 'مُسْتَفْعِلُنْ فاعلن مستفعلن فَعِلُن * مستفعلن فاعلن مستفعلن فَعِلُن',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلُنْ'
                },
                {
                    K: '1110',
                    V: 'فعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: '1110',
            Value: 'فعِلُنْ'
        },

        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلُنْ'
                },
                {
                    K: '1110',
                    V: 'فعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: '1110',
            Value: 'فعِلُنْ'
        },
    ],
    'nobdhah': baseet +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />تَاللهِ مَا بَقِيَتْ دُنْيَا لِصَاحِبهَا * دَوْمًا وَإِنْ بَقِيَتْ يَذْهَبْ كَمَنْ ذَهَبُوا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />تَلْلاهِ مَا بَقِيَتْ دُنْيَا لِصَاحِبِهَا * دَوْمَنْ وَإِنْ بَقِيَتْ يَذْهَبْ كَمَنْ ذَهَبُو' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(///ه)(/ه/ه//ه)(///ه) * (/ه/ه//ه)(///ه)(/ه/ه//ه)(///ه)' +
        cp
};

// تام 2
awzaan['baseet2'] = {
    'name': 'البحر البسيط',
    'type': 'تام',
    'desc': '[العروض: مخبونة] - [الضرب: مقطوع]',
    'orig': 'مُسْتَفْعِلُنْ فاعلن مستفعلن فَعِلُن * مستفعلن فاعلن مستفعلن فاعلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلُنْ'
                },
                {
                    K: '1110',
                    V: 'فعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: '1110',
            Value: 'فعِلُنْ'
        },

        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلُنْ'
                },
                {
                    K: '1110',
                    V: 'فعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: '1010',
            Value: 'فاعِلْ'
        },
    ],
    'nobdhah': baseet +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />إِني أَعوذُ بِمَن حَجَّ الحَجيجُ لَهُ * وَالرافِعُونَ لِدينِ اللَهِ أَرْكانا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />تَلْلاهِ مَا بَقِيَتْ دُنْيَا لِصَاحِبِهَا * دَوْمَنْ وَإِنْ بَقِيَتْ يَذْهَبْ كَمَنْ ذَهَبُو' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(///ه)(/ه/ه//ه)(///ه) * (/ه/ه//ه)(///ه)(/ه/ه//ه)(/ه/ه)' +
        cp
};

// مجزوء
awzaan['baseet3'] = {
    'name': 'البحر البسيط',
    'type': 'مجزوء',
    'desc': '[العروض: مخبونة مقطوعة] - [الضرب: مخبون مقطوع]',
    'orig': 'مُسْتَفْعِلُنْ فاعلن مُتَفْعِلْ * مُسْتَفْعِلُنْ فاعلن مُتَفْعِلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلُنْ'
                },
                {
                    K: '1110',
                    V: 'فعِلُنْ'
                },
            ]
        },
        {
            Key: '11010',
            Value: 'مُتَفْعِلْ'
        },

        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُسْتَعِلُنْ'
                },
                {
                    K: '11110',
                    V: 'مُتَعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلُنْ'
                },
                {
                    K: '1110',
                    V: 'فعِلُنْ'
                },
            ]
        },
        {
            Key: '11010',
            Value: 'مُتَفْعِلْ'
        },
    ],
    'nobdhah': baseet +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />أحْسَنْتُ ظَنِّي بأهْلِ دَهْرِي * فَحُسْنُ ظَنِّي بهمْ دَهاني' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />أحْسَنْتُ ظَنْنِي بأهْلِ دَهْرِي * فَحُسْنُ ظَنْنِي بهمْ دَهاني' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(/ه//ه)(//ه/ه) * (//ه//ه)(/ه//ه)(//ه/ه)' +
        cp
};