/***********************************/
// الهزج
/***********************************/
var hazaj =
    bp +
    'بحر (الهَزَج) بفتح الهاء والزاي، سُمِّيَ بذلك تشبيهًا له بهَزَج الصوت، أي: تردد الصوت، وقيل: لأن العرب كثيرًا ما كانوا يهزجون به، أي: يغنون به، لِما فيه من خِفَّة على اللسان، وسهولة في النظم، وقيل غير ذلك.' +
    '<br />◆ أصل بنائه : مَفاعيلُنْ مَفاعيلُنْ مَفاعيلُنْ * مَفاعيلُنْ مَفاعيلُنْ مَفاعيلُنْ.' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />لم يرد إلَّا مجزوءًا بإسقاط تفعيلة من كل شطر:' +
    '<br />1️⃣ مجزوء (صحيح العروض والضرب).' +
    '<br />2️⃣ مجزوء (عروضه صحيحة، وضربه محذوف).' +
    '<br />3️⃣ مجزوء (عروضه صحيحة، وضربه مقصور).' +
    '<br />4️⃣ مجزوء (عروضه محذوف، وضربه محذوف).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_9">للاستزادة</a>' +
    cp;

// مجزوء 1
awzaan['hazaj1'] = {
    'name': 'بحر الهزج',
    'type': 'مجزوء',
    'desc': '[العروض: صحيحة] - [الضرب: صحيح]',
    'orig': 'مَفاعيلُنْ مَفاعيلُنْ * مَفاعيلُنْ مَفاعيلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: '1101010',
            Value: 'مَفاعيلُنْ'
        }
    ],
    'nobdhah': hazaj +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />أَرَامَ الْقَوْمُ أَحْكَامًا * أَتَتْ وَالشِّرْكَ مِنْ جُبِّ' +
        '<br />وَظَنُّوا ذَاكَ إسْلامًا * بحُكْمِ الشَّعْبِ لِلشَّعْبِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />أَرَامَ لْقَوْمُ أَحْكَامَنْ * أَتَتْ وَشْشِرْكَ مِنْ جُبْبي' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه/ه) (//ه/ه/ه) * (//ه/ه/ه) (//ه/ه/ه)' +
        cp
};

// مجزوء 2
awzaan['hazaj2'] = {
    'name': 'بحر الهزج',
    'type': 'مجزوء',
    'desc': '[العروض: صحيحة] - [الضرب: محذوف]',
    'orig': 'مَفاعيلُنْ مَفاعيلُنْ * مَفاعيلُنْ مَفاعي (فَعُولن)',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: '11010',
            Value: 'فَعُولُنْ'
        }
    ],
    'nobdhah': hazaj +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />وَمَا ظَهْرِي لِبَاغِي الضَّيْ * مِ بِالظَّهْرِ الذَّلُولِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />وَمَا ظَهْرِي لِبَاغِ ضْضَيْ * مِ بظْظَهْرِ ذْذَلُولِي' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه/ه) (//ه/ه/ه) * (//ه/ه/ه) (//ه/ه)' +
        cp
};

// مجزوء 3
awzaan['hazaj3'] = {
    'name': 'بحر الهزج',
    'type': 'مجزوء',
    'desc': '[العروض: صحيحة] - [الضرب: مقصور]',
    'orig': 'مَفاعيلُنْ مَفاعيلُنْ * مَفاعيلُنْ مَفاعِيلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: '110100',
            Value: 'مَفاعِيلْ'
        }
    ],
    'nobdhah': hazaj +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />وَمَا لَيثُ عَرينٍ ذو * أظافير وأسنانْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />وَمَا لَيثُ عَرينِنْ ذو * أظافيرَ وأسنانْ' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه/) (//ه/ه/ه) * (//ه/ه/) (//ه/ه/)' +
        cp
};

// مجزوء 4
awzaan['hazaj4'] = {
    'name': 'بحر الهزج',
    'type': 'مجزوء',
    'desc': '[العروض: محذوف] - [الضرب: محذوف]',
    'orig': 'مَفاعيلُنْ مَفاعِي (فَعُولن) * مَفاعيلُنْ مَفاعي (فَعُولن)',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: '11010',
            Value: 'فَعُولُنْ'
        },
        {
            Key: 'x',
            Value: [{
                    K: '1101010',
                    V: 'مَفاعيلُنْ'
                },
                {
                    K: '110101',
                    V: 'مَفاعيلُ'
                }
            ]
        },
        {
            Key: '11010',
            Value: 'فَعُولُنْ'
        }
    ],
    'nobdhah': hazaj +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />سَقَاهَا الَّلهُ غَيْثاً * مِنَ الوَسْمِيِّ ريّا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />سَقَاهَ لْلاهُ غَيْثَنْ * مِنَ لْوَسْمِيْيِ رَيْيَا' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه/ه) (//ه/ه) * (//ه/ه/ه) (//ه/ه)' +
        cp
};