/***********************************/
// الكامل
/***********************************/
var kaamel =
    bp +
    'البحر الكامل، من أشهر بحور الشعر العربي ومن أكثرها رواجًا (البحر الكامل) ويسمى بالكامل لكثرة حركاته فقد يشتمل البيت التام منه على ثلاثين حركة ، فهو أكمل في الحركات من البحر الوافر.' +
    '<br />◆ أصل بنائه: مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفاعِلُنْ * مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفاعِلُنْ.' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تامّ (صحيح العروض والضرب).' +
    '<br />2️⃣ تامّ (عروضه صحيحة ، وضربه مقطوع).' +
    '<br />3️⃣ تامّ (عروضه صحيحة ، وضربه أحَذّ مُضْمَر).' +
    '<br />4️⃣ تامّ (عروضه حَذّاء ، وضربه أحَذّ مُضْمَر).' +
    '<br />5️⃣ تامّ (عروضه حَذّاء ، وضربه أحَذّ).' +
    '<br />6️⃣ مجزوء (صحيح العروض والضرب).' +
    '<br />7️⃣ مجزوء (عروضه صحيحة ، وضربه مُذَيَّل).' +
    '<br />8️⃣ مجزوء (عروضه صحيحة ، وضربه مُرَفَّل).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_13">للاستزادة</a>' +
    cp;

// تام 1
awzaan['kaamel1'] = {
    'name': 'البحر الكامل',
    'type': 'تام',
    'desc': '[العروض: صحيح] - [الضرب: صحيح]',
    'orig': 'مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفاعِلُنْ * مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفاعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />حَتَّى إذَا جَحَدُوا عِلاقَتَهُ بهَا * إنِّي بَرِيءٌ مِنْ فِعَالِ الصِّبْيَةِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />حَتْتَىْ إِذَاْ جَحَدُوْ عَلَاْقَتَهُوْ بِهَاْ * إِنْنِيْ بَرِيْؤُنْ مِنْ فِعَاْلِ صْصِبْيَتِيْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(///ه//ه)(///ه//ه) * (/ه/ه//ه)(/ه/ه//ه)(/ه/ه//ه)' +
        cp
};

// تام 2
awzaan['kaamel2'] = {
    'name': 'البحر الكامل',
    'type': 'تام',
    'desc': '[العروض: صحيح] - [الضرب: مقطوع]',
    'orig': 'مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفاعِلُنْ * مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفاعِلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '111010',
                    V: 'مُتَفاعِلْ'
                },
                {
                    K: '101010',
                    V: 'مُتْفاعِلْ'
                }
            ]
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />وَمَنِ ادَّعَى سَلَفِيَّةً فَلْيَلْتَزِمْ * فَهْمَ الصَّحَابَةِ دُونَ تَأويلاتِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />وَمَنِ دْدَعَى سَلَفِيْيَتَنْ فَلْيَلْتَزِمْ * فَهْمَ صْصَحَابَتِ دُونَ تَأويلاتِي' +
        '<br />● ترميز البيت:' +
        '<br /> (///ه//ه)(///ه//ه)(/ه/ه//ه) * (/ه/ه//ه)(/ه/ه//ه)(/ه/ه/ه)' +
        cp
};

// تام 3
awzaan['kaamel3'] = {
    'name': 'البحر الكامل',
    'type': 'تام',
    'desc': '[العروض: صحيح] - [الضرب: أحَذّ مُضْمَر]',
    'orig': 'مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفاعِلُنْ * مُتَفاعِلُنْ مُتَفاعِلُنْ مُتْفَا (فَاعِلْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: '1010',
            Value: 'فَاعِلْ'
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />أوَلَمْ تَكُنْ في مَعْزِلٍ عَنْ فِتْنَةٍ * وَسَلِمْتَ مِنْها أَوَّلَ الأَمْرِ ؟' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />أوَلَمْ تَكُنْ في مَعْزِلِنْ عَنْ فِتْنَتِنْ * وَسَلِمْتَ مِنْها أَوْوَلَ لْأَمْرِي' +
        '<br />● ترميز البيت:' +
        '<br />(///ه//ه)(/ه/ه//ه)(/ه/ه//ه) * (///ه//ه)(/ه/ه//ه)(/ه/ه)' +
        cp
};

// تام 4
awzaan['kaamel4'] = {
    'name': 'البحر الكامل',
    'type': 'تام',
    'desc': '[العروض: حَذّاء] - [الضرب: أحَذّ مُضْمَر]',
    'orig': 'مُتَفاعِلُنْ متفاعلن مُتَفا (فَعِلُنْ) * مُتفاعلن متفاعلن مُتْفا (فَاعِلْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: '1110',
            Value: 'فَعِلُنْ'
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: '1010',
            Value: 'فَاعِلْ'
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />ثِنْتانِ لا أدْنُو لِوَصْلِهما * عِرْسُ الخَليلِ وجارَةُ الجَنْبِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />ثِنْتانِ لا أدْنُو لِوَصْلِهما * عِرْسُ لْخَليلِ وجارَتُ لْجَنْبي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(/ه/ه//ه)(///ه) * (/ه/ه//ه)(///ه//ه)(/ه/ه)' +
        cp
};

// تام 5
awzaan['kaamel5'] = {
    'name': 'البحر الكامل',
    'type': 'تام',
    'desc': '[العروض: حَذّاء] - [الضرب: أحَذّ]',
    'orig': 'مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفا (فَعِلُنْ) * مُتَفاعِلُنْ مُتَفاعِلُنْ مُتَفا (فَعِلُنْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: '1110',
            Value: 'فَعِلُنْ'
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: '1110',
            Value: 'فَعِلُنْ'
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />يا عاصِيًا في السِّرِّ مُجْتَهِدًا * وَزَعَمْتَ تَقْوَى اللهِ في الْعَلَنِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />يا عاصِيَنْ فِسْسِرْرِ مُجْتَهِدَنْ * وَزَعَمْتَ تَقْوَ لْلاهِ فِلْعَلَني' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(/ه/ه//ه)(///ه) * (///ه//ه)(/ه/ه//ه)(///ه)' +
        cp
};

// مجزوء 1
awzaan['kaamel6'] = {
    'name': 'البحر الكامل',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: صحيح]',
    'orig': 'مُتَفاعِلُنْ مُتَفاعِلُنْ * مُتَفاعِلُنْ مُتَفاعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />يا مَنْ تُحِبُّ رَسُولَنَا * وَ زَعَمْتَ حُبًّا مُوقَدَا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />يا مَنْ تُحِبْبُ رَسُولَنَا * وَزَعَمْتَ حُبْبَنْ مُوقَدَا' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(///ه//ه) * (///ه//ه)(/ه/ه//ه)' +
        cp
};

// مجزوء 2
awzaan['kaamel7'] = {
    'name': 'البحر الكامل',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: مُذَيَّل]',
    'orig': 'مُتَفاعِلُنْ مُتَفاعِلُنْ * مُتَفاعِلُنْ مُتَفاعِلانْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '11101100',
                    V: 'مُتَفاعِلَانْ'
                },
                {
                    K: '10101100',
                    V: 'مُتْفاعِلَانْ'
                },
                {
                    K: '1111100',
                    V: 'مُتَفَعِلَانْ'
                },
                {
                    K: '1011100',
                    V: 'مُتْفَعِلَانْ'
                }
            ]
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />أرَأيْتَ شَرَّ جَمَاعَةٍ * يَتآمَرُونَ عَلَى البلادْ ؟!' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />أرَأيْتَ شَرْرَ جَمَاعَتِنْ * يَتأامَرُونَ عَلَ لْبلادْ' +
        '<br />● ترميز البيت:' +
        '<br />(///ه//ه)(///ه//ه) * (///ه//ه)(///ه//ه ه)' +
        cp
};

// مجزوء 3
awzaan['kaamel8'] = {
    'name': 'البحر الكامل',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: مُرَفَّل]',
    'orig': 'مُتَفاعِلُنْ مُتَفاعِلُنْ * مُتَفاعِلُنْ مُتَفاعِلاتُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1110110',
                    V: 'مُتَفاعِلُنْ'
                },
                {
                    K: '1010110',
                    V: 'مُتْفاعِلُنْ'
                },
                {
                    K: '111110',
                    V: 'مُتَفَعِلُنْ'
                },
                {
                    K: '101110',
                    V: 'مُتْفَعِلُنْ'
                }
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '111011010',
                    V: 'مُتَفاعِلَاتُنْ'
                },
                {
                    K: '101011010',
                    V: 'مُتْفاعِلَاتُنْ'
                },
                {
                    K: '11111010',
                    V: 'مُتَفَعِلَاتُنْ'
                },
                {
                    K: '10111010',
                    V: 'مُتْفَعِلَاتُنْ'
                }
            ]
        },
    ],
    'nobdhah': kaamel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />دَيُّوثُ قَوْمٍ قَدْ غَدَا * مُتَظاهِرًا، مَعَهُ النساءُ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />دَيْيُوثُ قَوْمِنْ قَدْ غَدَا * مُتَظاهِرَنْ مَعَهُ نْنِساءُو' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(/ه/ه//ه) * (///ه//ه)(///ه//ه/ه)' +
        cp
};