/***********************************/
// الخفيف
/***********************************/

var khafeef =
    bp +
    'البحر الخفيف، وسُمِّيَ بذلك لخفته على اللسان، وفي بنائه لينٌ يجعله قريبًا من النثر، ولذلك فهو صالح الاستعمال في التعبير عن معظم المعاني من فرحٍ وحزنٍ وشكوى ورثاء وعتاب وحماسة وفخر ومدح وهجاء وحكمة..' +
    '<br />◆ أصل بنائه: فاعلاتن مُسْتَفْعِ لُنْ فاعلاتن * فاعلاتن مستفعِ لُنْ فاعلاتن' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تام (صحيح العروض والضرب).' +
    '<br />2️⃣ تام (محذوف العروض والضرب).' +
    '<br />3️⃣ مجزوء (صحيح العروض والضرب).' +
    '<br />4️⃣ مجزوء (عروضه صحيحة ، وضربه مخبون مقصور).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_21">للاستزادة</a>' +
    cp;

// تام 1
awzaan['khafeef1'] = {
    'name': 'البحر الخفيف',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: صحيح]',
    'orig': 'فاعلاتن مستفعِلُنْ فاعلاتن * فاعلاتن مستفعِلُنْ فاعلاتن',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },

        {
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
    ],
    'nobdhah': khafeef +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />كَيْفَ أَرْجُو الصَّلاحَ مِنْ أَمْرِ قَوْمٍ * ضَيَّعُوا الْحَزْمَ فيهِ أَيُّ ضَياعِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />كَيْفَ أَرْجُ صْصَلاحَ مِنْ أَمْرِ قَوْمِنْ * ضَيْيَعُ لْحَزْمَ فيهِ أَيْيُ ضَياعِي' +
        '<br />● ترميز البيت:' +
        '<br /> (/ه//ه/ه)(//ه//ه)(/ه//ه/ه) * (/ه//ه/ه)(//ه//ه)(///ه/ه)' +
        cp
};

// تام 2
awzaan['khafeef2'] = {
    'name': 'البحر الخفيف',
    'type': 'تام',
    'desc': '[العروض: محذوفة] - [الضرب: محذوف]',
    'orig': 'فاعلاتن مستفعِلُنْ فاعلا (فاعلن) * فاعلاتن مستفعِلُنْ فاعلا (فاعلن)',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلن'
                },
                {
                    K: '1110',
                    V: 'فعِلن'
                },
            ]
        },

        {
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '10110',
                    V: 'فاعِلن'
                },
                {
                    K: '1110',
                    V: 'فعِلن'
                },
            ]
        },
    ],
    'nobdhah': khafeef +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />إِنْ قَدَرْنا يَوْمًا عَلَى عامِرٍ * نَنْتَصِفْ مِنْهُ أَوْ نَدَعْهُ لَكُمْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />إِنْ قَدَرْنا يَوْمَنْ عَلَى عامِرِنْ * نَنْتَصِفْ مِنْهُ أَوْ نَدَعْهُ لَكُمْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه/ه//ه)(/ه//ه) * (/ه//ه/ه)(//ه//ه)(///ه)' +
        cp
};

// مجزوء 1
awzaan['khafeef3'] = {
    'name': 'البحر الخفيف',
    'type': 'مجزوء',
    'desc': '[العروض: صحيحة ] - [الضرب: صحيح]',
    'orig': 'فاعلاتن مستفعِلُنْ * فاعلاتن مستفعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
            ]
        },

        {
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
            ]
        },
    ],
    'nobdhah': khafeef +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />يا حَرِيصًا عَلَى الْغِنَى * قاعِدًا بالمَرَاصِدِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />يا حَرِيصَنْ عَلَ لْغِنَى * قاعِدَنْ بلْمَرَاصِدِي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(//ه//ه) * (/ه//ه/ه)(//ه//ه)' +
        cp
};

// مجزوء 2
awzaan['khafeef4'] = {
    'name': 'البحر الخفيف',
    'type': 'مجزوء',
    'desc': '[العروض: صحيحة ] - [الضرب: مخبون مقصور]',
    'orig': 'فاعلاتن مستفعِلُنْ * فاعلاتن مُتَفْعِلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: 'x',
            Value: [{
                    K: '1010110',
                    V: 'مُسْتَفْعِلُنْ'
                },
                {
                    K: '110110',
                    V: 'مُتَفْعِلُنْ'
                },
            ]
        },

        {
            Key: 'x',
            Value: [{
                    K: '1011010',
                    V: 'فاعِلاتُنْ'
                },
                {
                    K: '111010',
                    V: 'فعِلاتُنْ'
                },
                {
                    K: '101010',
                    V: 'فالاتُنْ'
                },
            ]
        },
        {
            Key: '11010',
            Value: 'مُتَفْعِلْ'
        },
    ],
    'nobdhah': khafeef +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />كُلُّ خَطْبٍ إِنْ لَمْ تَكُو * نُوا غَضِبْتُمْ يَسِيرُ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />كُلْلُ خَطْبنْ إِنْ لَمْ تَكُو * نُو غَضِبْتُمْ يَسِيرُو' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه/ه//ه) * (/ه//ه/ه)(//ه/ه)' +
        cp
};