/***********************************/
// المُقتضَب
/***********************************/

var mo9tadhab =
    bp +
    'البحر المقتضب، بضم الميم وإسكان القاف وفتح التاء المثناة الفوقية وفتح الضاد المعجمة، وسُمِّيَ بذلك لأنه اقْتُضِبَ من غيره، أي: اقْتُطِعَ من بحر المنسرح بإسقاط تفعيلته الأولى من كل شطر. وهذا البحر قليل الاستعمال قديمًا وحديثًا وشواهده نادرة حتى أن من العروضيين من أنكره.' +
    '<br />◆ أصل بنائه: مفعولاتُ مستفعلن مستفعلن * مفعولاتُ مستفعلن مستفعلن' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />لم يرد إلا مجزوءًا مَطْوِيَّ العروض والضرب، ولو صورٌ أخرى غير واردة في هذا التطبيق.' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_23">للاستزادة</a>' +
    cp;

awzaan['mo9tadhab1'] = {
    'name': 'البحر المُقتضَب',
    'type': 'مجزوء',
    'desc': '[العروض: مَطْوِية] - [الضرب: مَطْوِي]',
    'orig': 'مَفْعُلاتُ (فاعِلاتُ) مُسْتَعِلُنْ (مُفْتَعِلُنْ) * مَفْعُلاتُ (فاعِلاتُ) مُسْتَعِلُنْ (مُفْتَعِلُنْ)',
    'taf3eelah': [
        { Key: '101101', Value: 'فاعِلاتُ' },
        { Key: '101110', Value: 'مُفْتَعِلُنْ' },

        { Key: '101101', Value: 'فاعِلاتُ' },
        { Key: '101110', Value: 'مُفْتَعِلُنْ' },
    ],
    'nobdhah': mo9tadhab +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />سَوْفَ يَنْجَلِي الْعَجَبُ * إِنْ تَبَيَّنَ السَّبَبُ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />سَوْفَ يَنْجَلِ لْعَجَبُو * إِنْ تَبَيْيَنَ سْسَبَبُو' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/)(/ه///ه) * (/ه//ه/)(/ه///ه)' +
        cp
};