/***********************************/
// المضارع
/***********************************/

var modhaare3 =
    bp +
    'البحر المضارع، بضم الميم وكسر الراء المهملة، وسُمِّيَ بذلك لمُضارَعته (أي: مشابهته) بحرَين، هما: الخفيف والمُنْسَرح، من حيث احتواء تفعيلته الوسطى من كل شطر على “وتد مفروق” واحتواء التفعيلتين الباقيتين على “وتد مجموع”، وقيل: غير ذلك.' +
    '<br />◆ أصل بنائه:  مَفاعيلُنْ فاعِلاتُنْ مفاعيلن * مفاعيلن فاعِلاتن مفاعيلن' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />لم يرد إلا مجزوءًا صحيح العروض والضرب.' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_22">للاستزادة</a>' +
    cp;

awzaan['modhaare31'] = {
    'name': 'البحر المضارع',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: صحيح]',
    'orig': 'مَفاعيلُ فاعِلاتُنْ * مفاعيلُ فاعِلاتن',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '110101', V: 'مَفاعيلُ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
            ]
        },
        { Key: '1011010', Value: 'فاعِلاتُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '110101', V: 'مَفاعيلُ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
            ]
        },
        { Key: '1011010', Value: 'فاعِلاتُنْ' },
    ],
    'nobdhah': modhaare3 +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />فَنَفْسِي لها حَنينٌ * وَقَلْبي له انْكِسَارُ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />فَنَفْسِي لها حَنينُنْ * وَقَلْبي لَهُ نْكِسَارُو' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه/)(/ه//ه/ه) * (//ه/ه/)(/ه//ه/ه)' +
        cp
};