/***********************************/
// المجتث
/***********************************/

var mojtath =
    bp +
    'البحر المُجتثّ، بِضم الميم وإسكان الجيم وفتح التاء المثناة الفوقية وتشديد الثاء المثلثة، وسُمِّيَ بذلك لأنه اجْتُثَّ من غيره، أي: اقْتُطِعَ من بحر الخفيف بإسقاط تفعيلته الأولى من كل شطر، وهذا البحر قليل الاستعمال قديمًا حتى أن بعض العروضيين أنكره لقلة شواهده، ولكن كثر استعماله في العصر العباسي وما بعده.' +
    '<br />◆ أصل بنائه:  مُسْتَفْعِلُنْ فاعلاتن فاعلاتن *** مستفعلن فاعلاتن فاعلاتن' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />لم يرد في الشعر القديم إلا مجزوءًا صحيح العروض والضرب، لكنه اكتسب العديد من الصور في الشعر المعاصر.' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_24">للاستزادة</a>' +
    cp;

// مجزوء 1
awzaan['mojtath1'] = {
    'name': 'البحر المجتث',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: صحيح]',
    'orig': 'مُسْتَفْعِلُنْ فاعلاتن * مستفعِلن فاعلاتن',
    'taf3eelah': [
        { Key: '1010110', Value: 'مُسْتَفْعِلُنْ' },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101010', V: 'فَالاتُنْ' }
            ]
        },

        { Key: '1010110', Value: 'مُسْتَفْعِلُنْ' },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101010', V: 'فَالاتُنْ' }
            ]
        },
    ],
    'nobdhah': mojtath +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />لَوْ كُنْتَ فَرْدًا وَحِيدًا * وَسْطَ انْتِكَاسِ الأُلُوفِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />لَوْ كُنْتَ فَرْدَنْ وَحِيدَنْ * وَسْطَ نْتِكاسِ لْأُلُوفِي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(/ه//ه/ه) * (/ه/ه//ه)(/ه//ه/ه)' +
        cp
};