/***********************************/
// المنسرح
/***********************************/

var monsarih =
    bp +
    'البحر المنسرح، بضم الميم وإسكان النون وفتح السين والراء المهملتين، أو بكسر الراء باعتباره اسمَ فاعل من الفعل انْسَرَحَ، أي: أسْرَعَ، وسُمِّيَ بذلك لاِنْسِراحه، أي: لسرعة جريانه على اللسان لكثرة أسبابه الخفيفة، وهذا البحر فيه رِقّة وخِفّة تجعله صالحًا لقصائد الرثاء والشكوى.' +
    '<br />◆ أصل بنائه: مُسْتَفْعِلُنْ مفعولاتُ مستفعلن *مستفعلن مفعولاتُ مستفعلن' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تام (عروضه صحيحة وضربه مَطْوِي).' +
    '<br />2️⃣ تام (عروضه صحيحة وضربه مقطوع).' +
    '<br />3️⃣ منهوك (عروضه وضربه مَوْقُوفان).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_20">للاستزادة</a>' +
    cp;

// تام 1
awzaan['monsarih1'] = {
    'name': 'البحر المنسرح',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: مَطْوِي]',
    'orig': 'مُسْتَفْعِلُنْ مفعولاتُ مستفعلن * مستفعلن مفعولاتُ مُسْتَعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010101', V: 'مَفْعُولاتُ' },
                { K: '101101', V: 'مَفْعُلاتُ' },
                { K: '110101', V: 'معولاتُ' },
                { K: '11101', V: 'مَعُلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010101', V: 'مَفْعُولاتُ' },
                { K: '101101', V: 'مَفْعُلاتُ' },
                { K: '110101', V: 'معولاتُ' },
                { K: '11101', V: 'مَعُلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
    ],
    'nobdhah': monsarih +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />ثَلاثَةٌ بُرِّزُوا بسَبْقِهمُ * نَضَّرَهُمْ رَبُّهُمْ إِذا نُشِرُوا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />ثَلاثَتُنْ بُرْرِزُو بسَبْقِهمُو * نَضْضَرَهُمْ رَبْبُهُمْ إِذا نُشِرُو' +
        '<br />● ترميز البيت:' +
        '<br />(//ه//ه)(/ه/ /ه/)(/ه///ه) * (/ه///ه)(/ه/ /ه/)(/ه///ه)' +
        cp
};

// تام 2
awzaan['monsarih2'] = {
    'name': 'البحر المنسرح',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: مقطوع]',
    'orig': 'مُسْتَفْعِلُنْ مفعولاتُ مستفعلن * مستفعلن مفعولاتُ مُسْتَفْعِلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010101', V: 'مَفْعُولاتُ' },
                { K: '101101', V: 'مَفْعُلاتُ' },
                { K: '110101', V: 'معولاتُ' },
                { K: '11101', V: 'مَعُلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },

        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010101', V: 'مَفْعُولاتُ' },
                { K: '101101', V: 'مَفْعُلاتُ' },
                { K: '110101', V: 'معولاتُ' },
                { K: '11101', V: 'مَعُلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '101010', V: 'مُسْتَفْعِلْ' },
                { K: '11010', V: 'مُتَفْعِلْ' },
                { K: '10110', V: 'مُسْتَعِلْ' },
                { K: '1110', V: 'مُتَعِلْ' },
            ]
        },
    ],
    'nobdhah': monsarih +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />أُسِيءُ ظَنِّي بكُلِّ مُحْتَقَرٍ * تأْتي بهِ وَالْحَقِيرُ مَنْ حَقَرْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />أُسِيءُ ظَنْنِي بكُلْلِ مُحْتَقَرِنْ * تأْتي بهِي وَلْحَقِيرُ مَنْ حَقَرْ' +
        '<br />● ترميز البيت:' +
        '<br />(//ه//ه)(/ه/ /ه/)(/ه///ه) * (/ه///ه)(/ه/ /ه/)(/ه///ه)' +
        cp
};

// منهوك
awzaan['monsarih3'] = {
    'name': 'البحر المنسرح',
    'type': 'منهوك',
    'desc': '[العروض: موقوفة] - [الضرب: موقوف]',
    'orig': 'مستفعلن مفعولاتْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010100', V: 'مَفْعُولاتْ' },
                { K: '101100', V: 'مَفْعُلاتْ' },
                { K: '110100', V: 'معولاتْ' },
                { K: '11100', V: 'مَعُلاتْ' }
            ]
        }
    ],
    'nobdhah': monsarih +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />مِنْ سَمْتِ أَهْلِ الإيمانْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />مِنْ سَمْتِ أَهْلِ لْإيمانْ' +
        '<br />● ترميز البيت:' +
        '<br /> (/ه/ه//ه)(/ه/ه/ه ه)' +
        cp
};