/***********************************/
// المتدارك
/***********************************/
var motadaarak =
    bp +
    'البحر المتدارك، قيل أن “الخليل” أهمله لعدم وقوفه على شواهد له، ثم توفرت الشواهد فيما بعد لدى “الأخفش الأوسط” فأثبته، وسَمّاهُ ب(المتدارَك) – بفتح الراء المهمَلة – لكونه تدارك به على “الخليل”، وبعض المحققين أنكر تلك الرواية، والله أعلم بالصواب، وقيل: يجوز كسر رائه على أنه اسم فاعل، بمعنى أنه تدارك البحر المتقارب، أي: التحق به، حيث يمثّل معكوسه، إذ يبنى على (فاعلن) التي هي معكوس (فعولن)، ولذلك سُمِّيَ بالشقيق، أي: شقيق المتقارب، وله أسماء أخرى، منها: الغريب، والمُحْدَث، والمُخْترَع، والمُتَّسَق، والخَبَب (تشبيهًا له بنوع من السير)، ورَكْض الخَيل، وضرب الناقوس، وكثرة أسمائه تدل على تنوع المعاني التي يصلح استخدامه فيها، إلا أنه يكون أكثر انسجامًا مع المعاني الحماسية كشقيقه المتقارب.' +
    '<br />◆ أصل بنائه: فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ * فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ.' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تام (صحيح العروض والضرب).' +
    '<br />2️⃣ تام (عروضه صحيحة، وضربه مخبون).' +
    '<br />3️⃣ تام (عروضه صحيحة، وضربه مقطوع).' +
    '<br />4️⃣ مجزوء (صحيح العروض والضرب).' +
    '<br />5️⃣ مجزوء (عروضه صحيحة، وضربه مُذَيّل).' +
    '<br />6️⃣ مجزوء (عروضه صحيحة، وضربه مخبون مُرَفّل).' +
    '<br />🔴 المجزوء في هذا البحر مزهود فيه ولا توجد فيه قصائد كاملة، ويُعتبر صناعة عروضية، لذلك تركناه، ونفس القول يصح عن التام صحيح العروض والضرب.' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_14">للاستزادة</a>' +
    cp;

// تام 1
awzaan['motadaarak1'] = {
    'name': 'البحر المتدارك',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: مخبون]',
    'orig': 'فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ * فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        { Key: '1110', Value: 'فَعِلُنْ' }
    ],
    'nobdhah': motadaarak +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />إنْ كنت بحقٍّ سُنِّيًّا * أعْرِضْ عن صُحْبةِ مَنْ فُتِنوا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />إنْ كنت بحقْقِنْ سُنْنِيْيَنْ * أعْرِضْ عن صُحْبَتِ مَنْ فُتِنو' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه)(///ه)(/ه/ه)(/ه/ه) * (/ه/ه)(/ه/ه)(///ه)(///ه)' +
        cp
};

// تام 2
awzaan['motadaarak2'] = {
    'name': 'البحر المتدارك',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: مقطوع]',
    'orig': 'فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ * فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1110', V: 'فَعِلُنْ' },
                { K: '1010', V: 'فَاعِلْ' }
            ]
        },
        { Key: '1010', Value: 'فَاعِلْ' }
    ],
    'nobdhah': motadaarak +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />ورسولُ الله مُعَلِّمُنا * دَمِيَتْ قَدَماهُ مِنَ الشُّكْرِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />ورسولُ لْلاهِ مُعَلْلِمُنا * دَمِيَتْ قَدَماهُ مِنَ شْشُكْرِي' +
        '<br />● ترميز البيت:' +
        '<br />(///ه)(/ه/ه)(///ه)(///ه) * (///ه)(///ه)(///ه)(/ه/ه)' +
        cp
};