/***********************************/
// المتقارب
/***********************************/
var mota9aarab =
    bp +
    'البحر المُتقارَب، بضم الميم وفتح التاء الفوقية، وفتح الراء المهملة ويجوز كسرها، والأصل فيها: الفتح، إذ هو مُتقارَبٌ فيه، أي: متقارَب بين أوتاده وأسبابه، فبين كل وتدين سبب، وبين كل سببين وتد، وأكثر استخدام هذا البحر في القصائد الحماسية.' +
    '<br />◆ أصل بنائه: فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُنْ * فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُنْ.' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تام (صحيح العروض والضرب).' +
    '<br />2️⃣ تام (عروضه صحيحة، وضربه مقصور).' +
    '<br />3️⃣ تام (عروضه صحيحة، وضربه محذوف).' +
    '<br />4️⃣ تام (عروضه صحيحة، وضربه أبتر).' +
    '<br />5️⃣ مجزوء (محذوف العروض والضرب).' +
    '<br />6️⃣ مجزوء (عروضه محذوف، وضربه أبتر).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_15">للاستزادة</a>' +
    cp;

// تام 1
awzaan['mota9aarab1'] = {
    'name': 'البحر المتقارب',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: صحيح]',
    'orig': 'فَعُولُنْ فَعُولُنْ فَعُولُنْ * فَعُولُنْ فَعُولُنْ فَعُولُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '11010', Value: 'فَعُولُنْ' }
    ],
    'nobdhah': mota9aarab +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />بشاراتُ ربي أتَتْ في الْقُرَانِ * بنَصْرٍ عَزِيزٍ قريبِ الأوانِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />بِشاراتُ ربْبي أتَتْ فِلْقُرانِ * بنَصْرِنْ عَزِيزِنْ قريبِ لْأوانِي' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه)(//ه/ه)(//ه/ه)(//ه/) * (//ه/ه)(//ه/ه)(//ه/ه)(//ه/ه)' +
        cp
};

// تام 2
awzaan['mota9aarab2'] = {
    'name': 'البحر المتقارب',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: مقصور]',
    'orig': 'فَعُولُنْ فَعُولُنْ فَعُولُنْ * فَعُولُنْ فَعُولُنْ فَعُولْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '1100', Value: 'فَعُولْ' }
    ],
    'nobdhah': mota9aarab +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />إذَا قِيلَ قالَ رسولٌ كريمٌ * عَلَيْهِ الصَّلاةُ وَ أزْكَى السَّلامْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />إذَا قِيلَ قالَ رسولُنْ كريمُنْ * عَلَيْهِ صْصَلاتُ وَأزْكَ سْسَلامْ' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه)(//ه/)(//ه/ه)(//ه/ه) * (//ه/ه)(//ه/)(//ه/ه)(//ه ه)' +
        cp
};

// تام 3
awzaan['mota9aarab3'] = {
    'name': 'البحر المتقارب',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: محذوف]',
    'orig': 'فَعُولُنْ فَعُولُنْ فَعُولُنْ * فَعُولُنْ فَعُولُنْ فَعُو',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' },
                { K: '110', V: 'فَعُو' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '110', Value: 'فَعُو' }
    ],
    'nobdhah': mota9aarab +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />إِذا كُنْتَ في نِعْمَةٍ فَارْعَها * فَإِنّ الْمَعاصي تُزيلُ النِّعَمْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />إِذا كُنْتَ في نِعْمَتِنْ فَرْعَها * فَإِنْنَ لْمَعاصي تُزيلُ نْنِعَمْ' +
        '<br />● ترميز البيت:' +
        '<br /> (//ه/ه)(//ه/ه)(//ه/ه)(//ه) * (//ه/ه)(//ه/ه)(//ه/ه)(//ه)' +
        cp
};

// تام 4
awzaan['mota9aarab4'] = {
    'name': 'البحر المتقارب',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: أبتر]',
    'orig': 'فَعُولُنْ فَعُولُنْ فَعُولُنْ * فَعُولُنْ فَعُولُنْ فَعْ (مفاعيلن)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' },
                { K: '110', V: 'فَعُو' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '10', Value: 'فَعْ' }
    ],
    'nobdhah': mota9aarab +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />لَقَدْ كُنْتُ في غَفْلَةٍ عَنْ حِسابي * وَعَنْ يَوْمِ مَوْتي وَتَكْفِيني' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br /> لَقَدْ كُنْتُ في غَفْلَتِنْ عَنْ حِسابي * وَعَنْ يَوْمِ مَوْتي وَتَكْفِيني' +
        '<br />● ترميز البيت:' +
        '<br /> (//ه/ه)(//ه/ه)(//ه/ه)(//ه/ه) * (//ه/ه)(//ه/ه)(//ه/)(ه/ه)' +
        cp
};

// مجزوء 1
awzaan['mota9aarab5'] = {
    'name': 'البحر المتقارب',
    'type': 'مجزوء',
    'desc': '[العروض: محذوف] - [الضرب: محذوف]',
    'orig': 'فَعُولُنْ فَعُولُنْ فَعُو * فَعُولُنْ فَعُولُنْ فَعُو',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '110', Value: 'فَعُو' },

        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '110', Value: 'فَعُو' },
    ],
    'nobdhah': mota9aarab +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />وَكَمْ لِي عَلَى بَلْدَتي * بُكاءٌ وَ مُسْتَعْبَرُ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />وَكَمْ لِي عَلَى بَلْدَتي * بُكاؤُنْ وَمُسْتَعْبَرُو' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه) (//ه/ه) (//ه) * (//ه/ه) (//ه/ه) (//ه)' +
        cp
};

// مجزوء 2
awzaan['mota9aarab6'] = {
    'name': 'البحر المتقارب',
    'type': 'مجزوء',
    'desc': '[العروض: محذوف] - [الضرب: أبتر]',
    'orig': 'فَعُولُنْ فَعُولُنْ فَعُو * فَعُولُنْ فَعُولُنْ فَعْ (مفاعيلن)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '110', Value: 'فَعُو' },

        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعُولُنْ' },
                { K: '1101', V: 'فَعُولُ' }
            ]
        },
        { Key: '10', Value: 'فَعْ' },
    ],
    'nobdhah': mota9aarab +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />تَعفّفْ ولا تَبتئِسْ * فما يُقضَ يأتيكَا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />تَعفْفَفْ وَلَا تَبتئِسْ * فَما يُقضَ يأتيكَا' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه) (//ه/ه) (//ه) * (//ه/ه) (//ه/ه) (/ه)' +
        cp
};