/***********************************/
// الرجز
/***********************************/

var rajaz =
    bp +
    'من البحور ذات التفعيلة الواحدة المتكررة سِتًّا: (بحر الرَّجَز) بفتح الراء والجيم المُعجَمَتَيْنِ، وتُسمَّى القصيدة منه: أُرجُوزَة، ويُعَدُّ من أشهر البحور العربية استعمالًا قديمًا وحديثًا، وقد سُمِّيَ بحر الرَّجَز بهذا الاسم لاِضطرابه، فيقال للناقة ذات الفخذين المرتعشتين: رَجْزَاء، ويظهر اضطرابه في كثرة الزِّحافات الجائزة في تفعيلاته؛ حيث يجوز حذف حرفين من كل تفعيلة، كما أنه أكثر البحور مُرونةً؛ بل هو البحر الوحيد الذي يُستعمل تامًّا ومجزوءًا ومشطورًا ومنهوكًا، مما جعله أسهل البحور بناءً على الإطلاق، حتى سَمَّاهُ القدماءُ: (حمار الشعراء)!' +
    '<br />◆ أصل بنائه : مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ * مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تامٌّ (صحيح العروض والضرب).' +
    '<br />2️⃣ تامٌّ (عروضه صحيحة، وضربه مقطوع).' +
    '<br />3️⃣ مجزوء (صحيح العروض والضرب).' +
    '<br />4️⃣ مشطور (صحيح العروض والضرب).' +
    '<br />5️⃣ مشطور (مقطوع العروض والضرب).' +
    '<br />6️⃣ منهوك (صحيح العروض والضرب).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_11">للاستزادة</a>' +
    cp;

// تام 1
awzaan['rajaz1'] = {
    'name': 'بحر الرجز',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: صحيحة]',
    'orig': 'مُسْتَفْعِلُنْ مُتَفْعِلُنْ مُتَفْعِلُنْ * مُسْتَعِلُنْ مُسْتَعِلُنْ مُتَفْعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
    ],
    'nobdhah': rajaz +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />للهِ دَرُّ حَافِظِ بْنِ أَحْمَدَا * ابْنِ عَلِيِّ الْحَكَمِيِّ مَحْتِدَا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />لِلْلاهِ دَرْرُ حَافِظِ بْنِ أَحْمَدَا * إبْنِ عَلِيْيِ لْحَكَمِيْيِ مَحْتِدَا' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه) (//ه//ه) (//ه//ه) * (/ه///ه) (/ه///ه) (//ه//ه)' +
        cp
};

// تام 2
awzaan['rajaz2'] = {
    'name': 'بحر الرجز',
    'type': 'تام',
    'desc': '[العروض: صحيحة] - [الضرب: مقطوع]',
    'orig': 'مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ * مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '101010', V: 'مُسْتَفْعِلْ' },
                { K: '11010', V: 'مُتَفْعِلْ' },
                { K: '10110', V: 'مُسْتَعِلْ' },
                { K: '1110', V: 'مُتَعِلْ' },
            ]
        },
    ],
    'nobdhah': rajaz +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />بِئْسَ الدُّعَاةُ لِلضَّلالِ وَالْهَوَى * تَتَبَّعُوا لِسُنَّةِ الْيَهُودِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />بئْسَ دْدُعَاتُ لِضْضَلالِ وَلْهَوَا * تَتَبْبَعُو لِسُنْنَتِ لْيَهُودِي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه) (//ه//ه) (//ه//ه) * (//ه//ه) (//ه//ه) (//ه/ه)' +
        cp
};

// مجزوء
awzaan['rajaz3'] = {
    'name': 'بحر الرجز',
    'type': 'مجزوء',
    'desc': '[العروض: صحيحة] - [الضرب: صحيح]',
    'orig': 'مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ * مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
    ],
    'nobdhah': rajaz +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />يا سَامِعًا دُعَاءَنا * وعَالِمًا بِحَالِنَا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />يا سَامِعَنْ دُعَاءَنا * وعَالِمَنْ بِحَالِنا' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه) (//ه//ه) * (//ه//ه) (//ه//ه)' +
        cp
};

// مشطور 1
awzaan['rajaz4'] = {
    'name': 'بحر الرجز',
    'type': 'مشطور',
    'desc': '[العروض: صحيحة] - [الضرب: صحيح]',
    'orig': 'مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
    ],
    'nobdhah': rajaz +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />حَمْدًا لِرَبِّنا وَلِيِّ النِّعْمَةِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />حَمْدَنْ لِرَبْبِنا وَلِيْيِ نْنِعْمَتِي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(//ه//ه)(/ه/ه//ه)' +
        cp
};

// مشطور 2
awzaan['rajaz5'] = {
    'name': 'بحر الرجز',
    'type': 'مشطور',
    'desc': '[العروض: مقطوعة] - [الضرب: مقطوع]',
    'orig': 'مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '101010', V: 'مُسْتَفْعِلْ' },
                { K: '11010', V: 'مُتَفْعِلْ' },
                { K: '10110', V: 'مُسْتَعِلْ' },
                { K: '1110', V: 'مُتَعِلْ' },
            ]
        },
    ],
    'nobdhah': rajaz +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />قَدْ شَمَّرَتْ عَنْ سَاقِهَا فَشُدُّوا' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />قَدْ شَمْمَرَتْ عَنْ سَاقِهَا فَشُدْدُو' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(//ه//ه)(/ه/ه//ه)' +
        cp
};

// منهوك
awzaan['rajaz6'] = {
    'name': 'بحر الرجز',
    'type': 'منهوك',
    'desc': '[العروض: صحيحة] - [الضرب: صحيح]',
    'orig': 'مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '101010', V: 'مُسْتَفْعِلْ' },
                { K: '11010', V: 'مُتَفْعِلْ' },
                { K: '10110', V: 'مُسْتَعِلْ' },
                { K: '1110', V: 'مُتَعِلْ' },
            ]
        },
    ],
    'nobdhah': rajaz +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />يا لَيْتَنِي فيها جَذَعْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />يا لَيْتَنِي فيها جَذَعْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه) (/ه/ه//ه)' +
        cp
};