/***********************************/
// الرمَل
/***********************************/
var ramal =
    bp +
    'بحر الرمل: بفتح الراء المهملة والميم، وسُمِّيَ بذلك تشبيهًا له برَمَل الحصير، أي: نسيجه، لأن بناء هذا البحر على (فاعلاتن) المركبة من وتد بين سببين، فإذا تتابعت التفعيلات رأيت الأوتاد والأسباب وكأنها منسوجة فيما بينها كالحصير . وقيل: إنما سُمِّيَ بالرمَل لسرعة النطق به، فالرمَل لغةً: هو الإسراع في السير . وقيل غير ذلك.' +
    '<br />◆ أصل بنائه: فاعِلاتُنْ فاعلاتن فاعلاتن * فاعلاتن فاعلاتن فاعلاتن.' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تامّ (العروض والضرب محذوفان).' +
    '<br />2️⃣ تامّ (عروضه محذوفة ، وضربه مقصور).' +
    '<br />3️⃣ تامّ (عروضه محذوفة ، وضربه صحيح).' +
    '<br />4️⃣ مجزوء (صحيح العروض والضرب).' +
    '<br />5️⃣ مجزوء (عروضه صحيحة ، وضربه محذوف).' +
    '<br />6️⃣ مجزوء (عروضه صحيحة ، وضربه مُسبغ).' +
    '<br />7️⃣ مجزوء (العروض والضرب محذوفان).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_13">للاستزادة</a>' +
    cp;

// تام 1
awzaan['ramal1'] = {
    'name': 'بحر الرمَل',
    'type': 'تام',
    'desc': '[العروض: محذوف] - [الضرب: محذوف]',
    'orig': 'فاعِلاتُنْ فاعِلاتُنْ فاعِلا * فاعِلاتُنْ فاعِلاتُنْ فاعِلا',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        { Key: '10110', Value: 'فَاعِلَا' },

        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        { Key: '10110', Value: 'فَاعِلَا' }
    ],
    'nobdhah': ramal +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />كَمْ تَجَنَّى ! كَمْ تَبَنَّى فِتْنَةً * أحْرَقَتْ في كُلِّ قُطْرٍ وادِيا !' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />كَمْ تَجَنْنَى كَمْ تَبَنْنَى فِتنَتَنْ * أَحرقَتْ فِكُلْلِ قُطرِنْ وادِيَا' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه//ه/)(/ه//ه) * (/ه//ه/ه)(///ه/ه)(/ه//ه)' +
        cp
};

// تام 2
awzaan['ramal2'] = {
    'name': 'بحر الرمَل',
    'type': 'تام',
    'desc': '[العروض: محذوف] - [الضرب: مقصور]',
    'orig': 'فاعِلاتُنْ فاعِلاتُنْ فاعِلا (فاعلن) * فاعِلاتُنْ فاعِلاتُنْ فاعِلاتْ (فاعلان)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        { Key: '10110', Value: 'فَاعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        { Key: '101100', Value: 'فَاعِلَانْ' }
    ],
    'nobdhah': ramal +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />لا تَلُومُوني على أخْطائهمْ * قَدْ عَلِمْتُمْ أنني منهم بَراءْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />لا تَلُومُوني على أخْطائهمْ * قَدْ عَلِمْتُمْ أنْنَنِي منهم بَراءْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه//ه/ه)(/ه//ه) * (/ه//ه/ه)(/ه//ه/ه)(/ه//ه ه)' +
        cp
};

// تام 3
awzaan['ramal3'] = {
    'name': 'بحر الرمَل',
    'type': 'تام',
    'desc': '[العروض: محذوف] - [الضرب: صحيح]',
    'orig': 'فَاعِلاتُنْ فَاعِلاتُنْ فَاعِلُنْ * فَاعِلاتُنْ فَاعِلاتُنْ فَاعِلاتُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '10110', V: 'فَاعِلُنْ' },
                { K: '1110', V: 'فَعِلُنْ' },
            ]
        },

        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
            ]
        },
    ],
    'nobdhah': ramal +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />يا دُعاةَ السُّوءِ ذُوقُوا فِتْنَةً * أدْخَلَتْكُمْ في صِراعٍ مُسْتَدِيمِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />يا دُعاتَ سْسُوءِ ذُوقُو فِتْنَتَنْ * أدْخَلَتْكُمْ في صِراعِنْ مُسْتَدِيمِي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه//ه/ه)(/ه//ه) * (/ه//ه/ه)(/ه//ه/ه)(/ه//ه/ه)' +
        cp
};

// مجزوء 1
awzaan['ramal4'] = {
    'name': 'بحر الرمَل',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: صحيح]',
    'orig': 'فَاعِلاتُنْ فَاعِلاتُنْ * فَاعِلاتُنْ فَاعِلاتُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        { Key: '1011010', Value: 'فَاعِلاتُنْ' },
    ],
    'nobdhah': ramal +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />لا تُزَمْجرْ لا تُثَرْثِرْ * لا تُفَكِّرْ كَالنَّطِيحَةْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />لا تُزَمْجرْ لا تُثَرْثِرْ * لا تُفَكْكِرْ كَنْنَطِيحَهْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه//ه/ه) * (/ه//ه/ه)(/ه//ه/ه)' +
        cp
};

// مجزوء 2
awzaan['ramal5'] = {
    'name': 'بحر الرمَل',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: محذوف]',
    'orig': 'فَاعِلاتُنْ فَاعِلاتُنْ * فَاعِلاتُنْ فَاعِلا (فَاعِلُنْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        { Key: '10110', Value: 'فَاعِلُنْ' },
    ],
    'nobdhah': ramal +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />فَاحْذَرُوا كَيْدَ الأعادِي * يا شبابَ الأُمَّةِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />فَحْذَرُو كَيْدَ لْأعادِي * يا شبابَ لْأُمْمَتي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه//ه/ه) * (/ه//ه/ه)(/ه//ه)' +
        cp
};

// مجزوء 3
awzaan['ramal6'] = {
    'name': 'بحر الرمَل',
    'type': 'مجزوء',
    'desc': '[العروض: صحيح] - [الضرب: مُسبّغ]',
    'orig': 'فَاعِلاتُنْ فَاعِلاتُنْ * فَاعِلاتُنْ فَاعِلاتَانْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        { Key: '1011100', Value: 'فَاعِلاتَانْ' },
    ],
    'nobdhah': ramal +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />أيها الرَّكْبُ المُخِبُّو * نَ على الأرض المُجدُّونْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />أيْيُهَ رْرَكْبُ لْمُخِبْبُو * نَ عَلَ لْأرْضِ لْمُجدْدُونْ' +
        '<br />● ترميز البيت:' +
        '<br /> (/ه//ه/ه)(/ه//ه/ه) * (///ه/ه)(/ه//ه/ه ه)' +
        cp
};

// مجزوء 4
awzaan['ramal7'] = {
    'name': 'بحر الرمَل',
    'type': 'مجزوء',
    'desc': '[العروض: محذوف] - [الضرب: محذوف]',
    'orig': 'فَاعِلاتُنْ فَعِلا * فَاعِلاتُنْ فَعِلا',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '10110', V: 'فَاعِلُنْ' },
                { K: '1110', V: 'فَعِلُنْ' }
            ]
        },

        {
            Key: 'x',
            Value: [
                { K: '1011010', V: 'فَاعِلاتُنْ' },
                { K: '111010', V: 'فَعِلاتُنْ' },
                { K: '101101', V: 'فاعِلاتُ' },
                { K: '11101', V: 'فَعِلاتُ' }
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '10110', V: 'فَاعِلُنْ' },
                { K: '1110', V: 'فَعِلُنْ' }
            ]
        },
    ],
    'nobdhah': ramal +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />طافَ يبغي نجوةً * مِن هلاكٍ فهلك' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />طافَ يَبْغي نَجْوَتَنْ * مِنْ هَلَاكِنْ فَهَلَكْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه//ه/ه)(/ه//ه) * (/ه//ه/ه)(///ه)' +
        cp
};