/***********************************/
// السريع
/***********************************/

var saree3 =
    bp +
    'البحر السريع، وسُمِّيَ بالسريع لسرعة النطق به، لكثرة أسبابه الخفيفة. وهذا البحر برغم سلاسته و رِقّتِه إلا أنه كان قليلَ الاستعمال في أشعار القدماء..' +
    '<br />◆ أصل بنائه: مُسْتَفْعِلُنْ مستفعلن مفعولاتُ *مستفعلن مستفعلن مفعولاتُ' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تام (عروضه وضربه مَخْبُونان مَكْسُوفان).' +
    '<br />2️⃣ تام (عروضه وضربه مَطْوِيّان مَكْسُوفان).' +
    '<br />3️⃣ تام (عروضه مَطْوِيّة مَكْسُوفَة، وضربه مَطْوِيٌّ مَوْقُوف).' +
    '<br />4️⃣ تام (عروضه مَطْوِيّة مَكْسُوفَة، وضربه أَصْلَم).' +
    '<br />5️⃣ مشطور (عروضه وضربه مَوْقُوفان).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_19">للاستزادة</a>' +
    cp;

// تام 1
awzaan['saree31'] = {
    'name': 'البحر السريع',
    'type': 'تام',
    'desc': '[العروض: مَخْبُونة مَكْسُوفة] - [الضرب: مَخْبُون مَكْسُوف]',
    'orig': 'مستفعلن مستفعلن مَعُلا (فَعِلُنْ) * مستفعلن مستفعلن مَعُلا (فَعِلُنْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '1110', Value: 'فَعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '1110', Value: 'فَعِلُنْ' },
    ],
    'nobdhah': saree3 +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />يا عالِمًا بالسِّرِّ وَالْعَلَنِ * وَكَاشِفًا لِلْكَرْبِ وَالْمِحَنِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />هَيِّءْ لَنا مِنْ أمْرِنا رَشَدًا * وَنَجّنا مِنْ هَذِهِ الْفِتَنِ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه //ه)(/ه/ه //ه)(///ه) * (//ه //ه)(/ه/ه //ه)(///ه)' +
        cp
};

// تام 2
awzaan['saree32'] = {
    'name': 'البحر السريع',
    'type': 'تام',
    'desc': '[العروض: مَطْوِيّة مَكْسُوفة] - [الضرب: مَطْوِيّ مَكْسُوف]',
    'orig': 'مستفعلن مستفعلن مَفْعُلا (فاعلن) * مستفعلن مستفعلن مَفْعُلا (فاعلن)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '10110', Value: 'فَاعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '10110', Value: 'فَاعِلُنْ' },
    ],
    'nobdhah': saree3 +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />مِنْ شَرَفِ الْفَقْرِ وَمِنْ فَضْلِهِ * عَلَى الْغِنَى لَوْ صَحَّ مِنْكَ النَّظَرْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />مِنْ شَرَفِ لْفَقْرِ وَمِنْ فَضْلِهِي * عَلَ لْغِنَى لَوْ صَحْحَ مِنْكَ نْنَظَرْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه///ه)(/ه///ه)(/ه//ه) * (//ه//ه)(/ه/ه//ه)(/ه//ه)' +
        cp
};

// تام 3
awzaan['saree33'] = {
    'name': 'البحر السريع',
    'type': 'تام',
    'desc': '[العروض: مَطْوِيّة مَكْسُوفة] - [الضرب: مَطْوِيّ مَوْقُوف]',
    'orig': 'مستفعلن مستفعلن مَفْعُلا (فاعلُنْ) * مستفعلن مستفعلن مَفْعُلاتْ (فاعلانْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '10110', Value: 'فَاعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '101100', Value: 'فَاعِلانْ' },
    ],
    'nobdhah': saree3 +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />كمْ حاسِدٍ لَمْ يَسْتَبحْ حُرْمَةً * مِنْكَ وَلَوْ مازَحْتَهُ لَاسْتَباحْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />كمْ حاسِدِنْ لَمْ يَسْتَبحْ حُرْمَتَنْ * مِنْكَ وَلَوْ مازَحْتَهُو لَسْتَباحْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(/ه/ه//ه)(/ه//ه) * (/ه ///ه)(/ه/ه//ه)(/ه//ه ه)' +
        cp
};

// تام 4
awzaan['saree34'] = {
    'name': 'البحر السريع',
    'type': 'تام',
    'desc': '[العروض: مَطْوِيّة مَكْسُوفة] - [الضرب: أَصْلَم]',
    'orig': 'مستفعلن مستفعلن مَفْعُلا (فاعلُنْ) * مستفعلن مستفعلن مفعو (فاعلْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '10110', Value: 'فَاعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '1010', Value: 'فَاعِلْ' },
    ],
    'nobdhah': saree3 +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br /> يا كَرَمَ الأُسْتاذِ نَحْوِي وَ يا * فَواضِلِ الشَّيْخِ الَّتِي عِنْدِي' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />يا كَرَمَ لْأُسْتاذِ نَحْوِي وَيا * فَواضِلِ شْشَيْخِ لْلَتِي عِنْدِي' +
        '<br />● ترميز البيت:' +
        '<br />(/ه///ه)(/ه/ه//ه)(/ه//ه) * (//ه//ه)(/ه/ه//ه)(/ه/ه)' +
        cp
};

// مشطور
awzaan['saree34'] = {
    'name': 'البحر السريع',
    'type': 'مشطور',
    'desc': '[العروض: مَوْقُوفة] - [الضرب: مَوْقُوف]',
    'orig': 'مستفعلن مستفعلن مَفْعُولاتْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1010110', V: 'مُسْتَفْعِلُنْ' },
                { K: '110110', V: 'مُتَفْعِلُنْ' },
                { K: '101110', V: 'مُسْتَعِلُنْ' },
                { K: '11110', V: 'مُتَعِلُنْ' },
            ]
        },
        { Key: '1010100', Value: 'مَفْعُولاتْ' },
    ],
    'nobdhah': saree3 +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />للهِ دَرُّ مَنْ هَجا بالأشْعارْ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />لِلْلاهِ دَرْرُ مَنْ هَجا بلْأشْعارْ' +
        '<br />● ترميز البيت:' +
        '<br />(/ه/ه//ه)(//ه//ه)(/ه/ه/ه ه)' +
        cp
};