/***********************************/
// الطويل
/***********************************/

var taweel =
    bp +
    'البحر الطويل، يتسع لكثير من المعاني ويستوعب ما لا يستوعبه غيره من البحور، فيصلح للمدح، والهجاء، والفرح، والحزن، والفخر، والحماسة، … إلخ. ولذلك تَوَسّعَ العرب في بناء قصائدهم عليه قديمًا وحديثًا. وكذلك استعمله العلماء في نظم المنظومات العلمية، ومن أشهر تلك المنظومات: الشاطبية في القراءات السبع، والدرة في القراءات الثلاث المتممة للعشر. ولم يستعمله العرب إلا تامًّا، ولذلك سُمِّيَ بالبحر (الطويل)، ولكونه أيضًا قد تصل حروف البيت الواحد منه إلى ثمانية وأربعين حرفًا.' +
    '<br />◆ أصل بنائه: فعولن مفاعيلن فعولن مفاعيلن * فعولن مفاعيلن فعولن مفاعيلن' +
    '<br />◆ صوره المروية عن العرب :' +
    '<br />1️⃣ تام (مقبوض العروض والضرب).' +
    '<br />2️⃣ تام (عروضه مقبوضة ، وضربه محذوف).' +
    '<br />3️⃣ تام (عروضه مقبوضة ، وضربه صحيح).' +
    '<br /><a target="_blank" href="https://abuqudamah.com/talkheesat_shafeyah_16">للاستزادة</a>' +
    cp;

// تام 1
awzaan['taweel1'] = {
    'name': 'البحر الطويل',
    'type': 'تام',
    'desc': '[العروض: مقبوضة] - [الضرب: مقبوض]',
    'orig': 'فعولن مفاعيلن فعولن مَفاعِلُنْ * فعولن مفاعيلن فعولن مَفاعِلُنْ',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
                { K: '1010', V: 'عُولُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1101010', V: 'مَفاعيلُنْ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
                { K: '110101', V: 'مَفاعيلُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        { Key: '110110', Value: 'مَفاعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1101010', V: 'مَفاعيلُنْ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
                { K: '110101', V: 'مَفاعيلُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        { Key: '110110', Value: 'مَفاعِلُنْ' },
    ],
    'nobdhah': taweel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />فَلَمَّا رَأَيْتُ الْقَلْبَ تَغْشَاهُ قَسْوَةٌ * وَيَعْلُوهُ رَانٌ مِنْ رِياءٍ وَ سُمْعَةِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />فَلَمْمَا رَأَيْتُ لْقَلْبَ تَغْشَاهُ قَسْوَتُنْ * وَيَعْلُوهُ رَانُنْ مِنْ رِيائنْ وَسُمْعَتي' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه)(//ه/ه/ه)(//ه/ه)(//ه//ه) * (//ه/ه)(//ه/ه/ه)(//ه/ه)(//ه//ه)' +
        cp
};

// تام 2
awzaan['taweel2'] = {
    'name': 'البحر الطويل',
    'type': 'تام',
    'desc': '[العروض: مقبوضة] - [الضرب: محذوف]',
    'orig': 'فعولن مفاعيلن فعولن مَفاعِلُنْ * فعولن مفاعيلن فعولن مَفاعِي (فَعولُنْ)',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
                { K: '1010', V: 'عُولُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1101010', V: 'مَفاعيلُنْ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
                { K: '110101', V: 'مَفاعيلُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        { Key: '110110', Value: 'مَفاعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1101010', V: 'مَفاعيلُنْ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
                { K: '110101', V: 'مَفاعيلُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        { Key: '11010', Value: 'فَعولُنْ' },
    ],
    'nobdhah': taweel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />إذا ما خَلَوْتَ الدَّهْرَ يوْمًا فلا تَقُلْ: * خَلَوْتُ. ولكِنْ قُلْ: عَلَيَّ رَقِيبُ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />إذا ما خَلَوْتَ دْدَهْرَ يَوْمَنْ فلا تَقُلْ * خَلَوْتُ ولاكِنْ قُلْ عَلَيْيَ رَقِيبُو' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه)(//ه/ه/ه)(//ه/ه)(//ه//ه) *(//ه/)(//ه/ه/ه)(//ه/)(//ه/ه)' +
        cp
};

// تام 3
awzaan['taweel3'] = {
    'name': 'البحر الطويل',
    'type': 'تام',
    'desc': '[العروض: مقبوضة] - [الضرب: صحيح]',
    'orig': 'فعولن مفاعيلن فعولن مَفاعِلُنْ * فعولن مفاعيلن فعولن مفاعيلن',
    'taf3eelah': [{
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
                { K: '1010', V: 'عُولُنْ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1101010', V: 'مَفاعيلُنْ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
                { K: '110101', V: 'مَفاعيلُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        { Key: '110110', Value: 'مَفاعِلُنْ' },

        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1101010', V: 'مَفاعيلُنْ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
                { K: '110101', V: 'مَفاعيلُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '11010', V: 'فَعولُنْ' },
                { K: '1101', V: 'فعولُ' },
            ]
        },
        {
            Key: 'x',
            Value: [
                { K: '1101010', V: 'مَفاعيلُنْ' },
                { K: '110110', V: 'مَفاعِلُنْ' },
                { K: '110101', V: 'مَفاعيلُ' },
            ]
        },
    ],
    'nobdhah': taweel +
        tp +
        '{ORIG}' +
        '<br />● مثال :' +
        '<br />فَتًى تَهْرُبُ الأموالُ مِنْ جُودِ كَفِّهِ * كما يَهْرُبُ الشَّيطانُ مِنْ لَيْلَةِ الْقَدْرِ' +
        '<br />● الكتابة العَرُوضِيّة:' +
        '<br />فَتَنْ تَهْرُبُ لأمْوالُ مِنْ جُودِ كَفْفِهِي * كما يَهْرُبُ شْشَيْطانُ مِنْ لَيْلَتِ لْقَدْرِي' +
        '<br />● ترميز البيت:' +
        '<br />(//ه/ه)(//ه/ه/ه)(//ه/ه)(//ه//ه) * (//ه/ه)(//ه/ه/ه)(/ه//ه)(//ه/ه/ه)' +
        cp
};